# CS1010 Assignment 3
### Instructor:
**Prof. Kartik Bulusu [CS & MAE]**

### GTA:
**Oscar Southwell**

### UTA:
**Sameen Ahmad, Talia Novack**

### LA:
**Manue Alaimo, Selman Eris, Saif Alzaabi, Gustavo Londono, Amy Longua, Pravin Khanal**

### Grader:
**Rutvik Solanki**

Put your names in the below cell inside the quotation marks!

In [1]:
#Your names go here!
name1 = 'Andre'

print('Assigmnet is submitted by ' + name1)

Assigmnet is submitted by Andre

In [2]:
#Please use 'Shift+Enter' to execute this cell
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

## Question 1.

We have provided a homework csv file in the Week3 folder named `HW3.csv`, pull this data into a dataframe called `my_df` and display that dataframe

**Hint:** use `pd.read_csv()` with an appropriate filename!

In [3]:
# YOUR CODE HERE
my_df = pd.read_csv('HW3.csv')

## Question 2. 

Drop the rows contain nan values from the frame using `my_df.dropna(axis=0)` and save the result to a frame called `my_df_new`. Display the first 7 lines of the frame using `.head()`

In [4]:
# YOUR CODE HERE
my_df.dropna(axis=0)
my_df.head()

   Name       Date     Food  Number
0  John  10/3/2021   Apples     5.0
1  John  10/4/2021  Oranges     4.0
2  John  10/5/2021   Apples     3.0
3  John  10/6/2021   Apples     6.0
4  John  10/7/2021   Apples     5.0

## Question 3. 

We want to get the total number of each food eaten by all people. To do this we will use `groupby` and `sum`. Our column of importance is going to be `'Food'`

**Explore the pandas functions** `.groupby()` **function and the** `.sum()` **function.**

These were not covered in the demonstration but it will be in your guided project. If you want reference material for them, we have linked the documentation! [Click for groupby](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html) and [Click for sum](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sum.html)

Alternatively, use our new best friend the `help()` function to try and figure out how they work! If you still have questions, there are plenty of resources available, such as office hours provided by members of the teaching team!

Remember you can always use `display()` to showcase a dataframe

To groupby the food names use `my_df_new.groupby('column name')` and save this result to `x`. Then use `x.sum()` to store the value in a variable named `total_fruits` and display the result. 

Here's a pseudo-code for what we are looking for:

```
x = YOUR_DATAFRAME.groupby(COLUMN_NAME)
RESULT = x.sum()
display(RESULT)
```

In [5]:
# YOUR CODE HERE
x = my_df.groupby('Food')
result = x.sum()
display(result)

,Name,Date,Number
Food,,,
Apples,JohnJohnJohnJohnJamesJames,10/3/202110/5/202110/6/202110/7/202110/4/20211...,23.0
Bananas,WendyWendyWendy,10/3/202110/5/202110/6/2021,13.0
Oranges,JohnJamesJamesJames,10/4/202110/3/202110/5/202110/7/2021,19.0

## Question 4. 

Update the number of apples in your new dataframe named `total_fruits` to the value 27 using `df.loc[slicing] = value`

Then display the updated dataframe

In [12]:
# YOUR CODE HERE
result.loc['Apples', 'Number'] = 27

result

,Name,Date,Number
Food,,,
Apples,JohnJohnJohnJohnJamesJames,10/3/202110/5/202110/6/202110/7/202110/4/20211...,27.0
Bananas,WendyWendyWendy,10/3/202110/5/202110/6/2021,13.0
Oranges,JohnJamesJamesJames,10/4/202110/3/202110/5/202110/7/2021,19.0

## Congrats!!
 You completed your 3rd Python Assignment in CS 1010! Give yourself a round of applause!!